using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace peach26
{
    class meaning : flower
    {
        public string showMean()
        {
            string mean = "";
            mean = "";
            if (flow == "ดอกทานตะวัน")
            {
                mean = "เป็นสัญลักษณ์ของความเชื่อมั่น ความมั่นคง รักเดียว ใจเดียว \n" +
                    "และมีนัยถึงศิลปะที่งดงาม ถ้าได้รับดอกตะวันเหมือนได้รับสารว่า \n" +
                    "แม้เธอจะเย่อหยิ่งเพียงไร แต่สักวันฉันจะชนะใจเธอ";
            }
            else if (flow == "ดอกกุหลาบ")
            {
                mean = "หมายถึง รักคุณเข้าแล้ว \n" +
                    "ความรักและความปรารถนา เป็นดอกไม้ของกามเทพ คิวปิด \n" +
                    "และอีรอส เป็นสิ่งนำโชคนำความรักมาให้แก่หญิงหรือชายที่ได้รับ ";
            }
            else if (flow == "ดอกซากุระ")
            {
                mean = "เป็นสัญลักษณ์ของความรัก ความโรแมนติก \nและความอ่อนโยนและอ่อนหวาน";
            }
            else if (flow == "ดอกชบา")
            {
                mean = "หมายถึง พบความสำเร็จ บานไม่รู้โรย หมายถึง รักไม่รู้โรย";
            }
            else if (flow == "ดอกลาเวนเดอร์")
            {
                mean = "หมายถึง การรอคอยอย่างมีความหวัง ความทรงจำอันงดงาม \n" +
                    "สามารถสื่อถึงความรุ่งโรจน์ที่มาพร้อมกับความสำเร็จและการบรรลุผล";
            }
            else if (flow == "ดอกเฟื่องฟ้า")
            {
                mean = "แสดงถึงความเบิกบาน สว่างไสว ความรุ่งเรืองที่ก้าวไกลแห่งชีวิต";
            }
            else if (flow == "ดอกมะลิ")
            {
                mean = "เป็นตัวแทนของความรัก และปราถนาดี อีกทั้งยังสื่อถึงความกตัญญูอีกด้วย";
            }
            else if (flow == "ดอกอัญชัน")
            {
                mean = "เป็นตัวแทนของความสงบ เยือกเย็น";
            }
            else
            {
                mean = ("กรุณาเลือกดอกไม้");
            }
            return mean;
        }
    }
}
